CSI API ETABS v1
cDesignCompositeBeam.SetComboStrength Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetComboStrength(
	string Name,
	bool Selected
)
Function SetComboStrength (
	Name As String,
	Selected As Boolean
) As Integer
Dim instance As cDesignCompositeBeam
Dim Name As String
Dim Selected As Boolean
Dim returnValue As Integer
returnValue = instance.SetComboStrength(Name,
	Selected)
int SetComboStrength(
	String^ Name,
	bool Selected
)
abstract SetComboStrength :
        Name : string *
        Selected : bool -> int
Parameters
Name
Type: System.String
Selected
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cDesignCompositeBeam Interface
ETABSv1 Namespace